tevoth/stm32f411/cmsis_spi/src/main.c
#include <stdio.h>
#include <stdint.h>
#include "stm32f4xx.h"
#include "led.h"
#include "uart.h"
#include "adx1345.h"

int16_t accel_x, accel_y, accel_z;
double accel_x_g, accel_y_g, accel_z_g;

uint8_t data_buffer[6];

int main(void) {
  led_init();
  uart_init();
  adxl_init();
  while(1) {
    led_toggle();
    adxl_read(ADXL345_REG_DATA_START, data_buffer);

    // combine high and low bytes to form the accel data
    accel_x = (int16_t)((data_buffer[1] << 8) | data_buffer[0]);
    accel_y = (int16_t)((data_buffer[3] << 8) | data_buffer[2]);
    accel_z = (int16_t)((data_buffer[5] << 8) | data_buffer[4]);

    // convert raw data to g values;     
    accel_x_g = accel_x * 0.0078;
    accel_y_g = accel_y * 0.0078;
    accel_z_g = accel_z * 0.0078;

    unsigned int t_accel_x = 1;
    unsigned int t_accel_y = 2;
    unsigned int t_accel_z = 3;
    printf("p_accel_x : %u p_accel_y : %u p_accel_z : %u\n", t_accel_x, t_accel_y, t_accel_z);
  }
  return 0;
}
